 var geoCoordMap = {
' 万城公司工业区-停车场 ': [ 114.1308 , 22.592997 ],
' 罗湖口岸交通楼-停车场 ': [ 114.126357 , 22.535295 ],
' 东方大厦-停车场 ': [ 114.131179 , 22.557639 ],
' 黄贝岭华侨新村-停车场 ': [ 114.142075 , 22.553433 ],
' 中医院第1门诊部-停车场 ': [ 114.119451 , 22.550038 ],
' 万象城-地下停车场 ': [ 114.116652 , 22.545627 ],
' 香格里拉酒店-停车场 ': [ 114.125114 , 22.540215 ],
' 国贸商业大厦-停车场 ': [ 114.126575 , 22.547875 ],
' 中泰来大酒店-停车场 ': [ 114.123499 , 22.550645 ],
' 世界金融中心-停车场 ': [ 114.120748 , 22.548028 ],
' 国贸大厦-停车场 ': [ 114.125784 , 22.547846 ],
' 深圳华润万象城二期-地下停车场 ': [ 114.118168 , 22.543588 ],
' 金稻田公寓-停车场 ': [ 114.126857 , 22.592363 ],
' 翠怡苑-停车场 ': [ 114.131609 , 22.593914 ],
' 捷泰公寓写字楼-停车场 ': [ 114.169428 , 22.611842 ],
' 荔景山色花园-地下二层停车场 ': [ 114.163508 , 22.610753 ],
' 翠岭苑-停车场 ': [ 114.136761 , 22.592191 ],
' 华港新村-停车场 ': [ 114.130639 , 22.593964 ],
' 停车场 ': [ 114.141869 , 22.590277 ],
' 绿景山庄-停车场 ': [ 114.129456 , 22.592011 ],
' 翠山路77号大院停车场 ': [ 114.130011 , 22.58835 ],
' 避风塘-停车场 ': [ 114.125261 , 22.590615 ],
' 停车场 ': [ 114.119617 , 22.593406 ],
' 草埔西鹤围村-停车场 ': [ 114.115844 , 22.590291 ],
' 龙园山庄-地下车库 ': [ 114.115023 , 22.592317 ],
' 龙园山庄-停车场 ': [ 114.116069 , 22.593033 ],
' 宝明花园-停车场 ': [ 114.113589 , 22.588552 ],
' 青海山庄-停车场 ': [ 114.113586 , 22.591252 ],
' 银湖国际会议中心-停车场 ': [ 114.083371 , 22.589062 ],
' 紫荆花园-停车场 ': [ 114.123942 , 22.593003 ],
' 停车场 ': [ 114.115628 , 22.589685 ],
' 鹏兴花园五期-停车场 ': [ 114.175339 , 22.564026 ],
' 航天晴山月名园-地下停车场 ': [ 114.194258 , 22.560869 ],
' 华景园南区-停车场 ': [ 114.183424 , 22.569494 ],
' 惠名花园-停车场 ': [ 114.190103 , 22.561682 ],
' 停车场 ': [ 114.173845 , 22.567731 ],
' 金色年华家园-地下停车场 ': [ 114.177575 , 22.567796 ],
' 港莲北村-停车场 ': [ 114.17648 , 22.56677 ],
' 聚福花园-停车场 ': [ 114.178914 , 22.566619 ],
' 天越翔园-停车场 ': [ 114.178345 , 22.569621 ],
' 仙湖山庄-物业停车场 ': [ 114.17683 , 22.574213 ],
' 深圳国威电子有限公司-停车场 ': [ 114.178676 , 22.570521 ],
' 城市东座-停车场 ': [ 114.176688 , 22.564783 ],
' 鹏兴花园一期-停车场 ': [ 114.171057 , 22.57115 ],
' 仙桐御景-地下停车场 ': [ 114.185148 , 22.570522 ],
' 深圳仙湖植物园-停车场 ': [ 114.185779 , 22.585566 ],
' 航天晴山月名园-停车场 ': [ 114.194667 , 22.560977 ],
' 万科-东方尊峪停车场 ': [ 114.197941 , 22.563055 ],
' 仙湖植物园-停车场 ': [ 114.185104 , 22.585241 ],
' 聚宝华府-地下停车场 ': [ 114.174996 , 22.569581 ],
' 桐景花园-停车场 ': [ 114.180279 , 22.564975 ],
' 熙悦庭菜馆-停车场 ': [ 114.136838 , 22.552432 ],
' 丹枫·白露城东1号-地下车库 ': [ 114.14627 , 22.551313 ],
' 翡翠·星空-地下车库 ': [ 114.13651 , 22.566691 ],
' 停车场 ': [ 114.133062 , 22.571753 ],
' 停车场 ': [ 114.127551 , 22.582813 ],
' 独树村综合楼-停车场 ': [ 114.127683 , 22.582762 ],
' 停车场 ': [ 114.129869 , 22.551263 ],
' 停车场 ': [ 114.13333 , 22.56947 ],
' 工纺大厦-地下停车场 ': [ 114.138293 , 22.552955 ],
' 6号大院-停车场 ': [ 114.139434 , 22.556271 ],
' 6号大院-停车场 ': [ 114.139955 , 22.555177 ],
' 松泉住宅区-停车场 ': [ 114.135705 , 22.584446 ],
' 松泉住宅区停车场 ': [ 114.135073 , 22.584038 ],
' 商业停车场 ': [ 114.14397 , 22.575844 ],
' 湖滨阁-西停车场 ': [ 114.144772 , 22.564553 ],
' 洪湖二街四号大院-停车场 ': [ 114.128601 , 22.568213 ],
' 金秀停车场 ': [ 114.146602 , 22.547175 ],
' 罗湖创意文化广场-停车场 ': [ 114.13435 , 22.54977 ],
' 鹏城花园北区-停车场 ': [ 114.148527 , 22.587291 ],
' 粤海珠宝综合广场-停车场 ': [ 114.130541 , 22.577331 ],
' 布心花园-停车场 ': [ 114.148821 , 22.581761 ],
' 自来水宿舍-停车场 ': [ 114.140467 , 22.553012 ],
' 中国物贸大厦-地下停车场 ': [ 114.136019 , 22.551605 ],
' 文锦南路小区-停车场 ': [ 114.137 , 22.547367 ],
' 文锦渡边检大厦-停车场 ': [ 114.143417 , 22.547864 ],
' 停车场 ': [ 114.128998 , 22.583602 ],
' 东莞外贸大厦-停车场 ': [ 114.130307 , 22.547268 ],
' 文锦渡海关生活区-停车场 ': [ 114.133741 , 22.545704 ],
' 鹏基西岭停车场 ': [ 114.166408 , 22.56091 ],
' 洪湖二街40号大院-停车场 ': [ 114.12713 , 22.567252 ],
' 麟腾苑-停车场 ': [ 114.150386 , 22.584072 ],
' 停车场 ': [ 114.132025 , 22.577315 ],
' 金迪名苑-地下停车场 ': [ 114.142447 , 22.58196 ],
' 停车场 ': [ 114.144774 , 22.569037 ],
' 百仕达花园四期-停车场 ': [ 114.145292 , 22.575911 ],
' 万事达酒店(深圳太宁店)-地下停车场 ': [ 114.142417 , 22.57546 ],
' 昇逸酒店-停车场 ': [ 114.136299 , 22.556914 ],
' 城东小区-停车场 ': [ 114.12905 , 22.554036 ],
' 停车场 ': [ 114.131988 , 22.54418 ],
' 金通大厦停车场-出入口 ': [ 114.140852 , 22.559014 ],
' 华清园-地下车库 ': [ 114.15828 , 22.559843 ],
' 深业大厦-地下停车场 ': [ 114.136847 , 22.554426 ],
' 深港新村管理处停车场 ': [ 114.154824 , 22.556018 ],
' 湖滨阁-北停车场 ': [ 114.144188 , 22.565042 ],
' 海富花园私家车场 ': [ 114.144429 , 22.55209 ],
' 中国物贸大厦-停车场 ': [ 114.136297 , 22.551634 ],
' 罗湖区人民检察院地下车库 ': [ 114.152288 , 22.56197 ],
' 停车场 ': [ 114.139613 , 22.574414 ],
' 瑞鹏大厦停车场(入口) ': [ 114.132523 , 22.545755 ],
' 万事达名苑-停车场 ': [ 114.142433 , 22.575509 ],
' 鸿业苑·名豪居-停车场 ': [ 114.139281 , 22.562997 ],
' 百仕达花园二期-三号地下停车场 ': [ 114.139047 , 22.58004 ],
' 鸿波电信大厦-地下停车场 ': [ 114.128842 , 22.565316 ],
' 新港鸿花园-停车场 ': [ 114.135533 , 22.579019 ],
' 锦星花园-东停车场 ': [ 114.140876 , 22.54882 ],
' 森威大厦-地下停车库 ': [ 114.136255 , 22.546507 ],
' 湖贝路旧区居民委员会-停车场 ': [ 114.135715 , 22.552899 ],
' 中国银行停车场 ': [ 114.13539 , 22.545012 ],
' 麟腾苑-地下停车场 ': [ 114.150385 , 22.584247 ],
' 深圳市人民医院第2门诊部-停车场 ': [ 114.134894 , 22.565466 ],
' 鸿昌广场-停车场 ': [ 114.13699 , 22.550571 ],
' 祥祺鹏大厦-停车场 ': [ 114.129545 , 22.572851 ],
' 联城证券大厦-停车场 ': [ 114.135384 , 22.54885 ],
' 美食大观园-停车场 ': [ 114.14839 , 22.559766 ],
' 翠田工业区-停车场 ': [ 114.137144 , 22.573588 ],
' 华盐股份有限公司-地面停车场 ': [ 114.136404 , 22.571008 ],
' 百仕达花园一期B区中心组团停车场 ': [ 114.141492 , 22.575914 ],
' 化工工业大厦-停车场 ': [ 114.143153 , 22.586915 ],
' 新王朝酒店-停车场 ': [ 114.139342 , 22.559053 ],
' 深圳古玩城-停车场 ': [ 114.149935 , 22.553911 ],
' 湖景花园-停车场 ': [ 114.126705 , 22.565558 ],
' 金安大厦-停车场 ': [ 114.138392 , 22.550512 ],
' 罗芳大酒店-停车场 ': [ 114.152361 , 22.558282 ],
' 东方都会-地下车库 ': [ 114.149742 , 22.553772 ],
' 东湖豪庭-停车场 ': [ 114.151307 , 22.582735 ],
' 停车场 ': [ 114.14102 , 22.554664 ],
' 洪湖春天地下车库(入口) ': [ 114.130849 , 22.572839 ],
' 嘉湖新都-地下停车场 ': [ 114.13108 , 22.572623 ],
' 碧波花园-停车场 ': [ 114.149502 , 22.565996 ],
' 特力大厦-地下停车场 ': [ 114.130005 , 22.57801 ],
' 凤山大厦-停车场 ': [ 114.140674 , 22.554326 ],
' 大地花园-停车场 ': [ 114.131329 , 22.582754 ],
' 布心新苑商务中心-智能停车库 ': [ 114.145731 , 22.584756 ],
' 东门金融大厦立体车库停车场 ': [ 114.128752 , 22.553514 ],
' 东安花园-停车场 ': [ 114.144176 , 22.577297 ],
' 电视广播大院-停车场 ': [ 114.146032 , 22.564368 ],
' 五矿大厦-停车场 ': [ 114.13053 , 22.544219 ],
' 贝丽花园-停车场 ': [ 114.132098 , 22.577379 ],
' 向西大厦-地下车库 ': [ 114.133053 , 22.549048 ],
' 停车场 ': [ 114.146076 , 22.582927 ],
' 深运大厦-停车场 ': [ 114.127945 , 22.556354 ],
' 深圳盐业大院停车场 ': [ 114.135629 , 22.571243 ],
' 华丽西村-停车场 ': [ 114.140861 , 22.557772 ],
' 湖贝东门市场大厦-停车场 ': [ 114.129371 , 22.553636 ],
' 停车场 ': [ 114.135134 , 22.562235 ],
' 老地方酒店-停车场 ': [ 114.132162 , 22.544775 ],
' 广西大厦-停车场 ': [ 114.131575 , 22.544353 ],
' 万科彩园-停车场 ': [ 114.127602 , 22.556631 ],
' 怡景花园-停车场 ': [ 114.14265 , 22.56191 ],
' 翠山花半里别馆-地下一层停车场 ': [ 114.127329 , 22.586125 ],
' 百仕达花园二期-停车场 ': [ 114.139353 , 22.579424 ],
' 逸湖居-地下停车场 ': [ 114.12974 , 22.574359 ],
' 兴华苑-停车场 ': [ 114.158084 , 22.554212 ],
' 潮逸轩-停车场 ': [ 114.168539 , 22.564549 ],
' 新南滨大楼-停车场 ': [ 114.126435 , 22.567236 ],
' 富驿时尚酒店-专用停车场 ': [ 114.148031 , 22.572708 ],
' 盛华大厦-停车场 ': [ 114.13047 , 22.551029 ],
' 文华大厦-停车场 ': [ 114.141913 , 22.551413 ],
' 翠山工业区-停车场 ': [ 114.128337 , 22.587479 ],
' 金迪名苑-停车场 ': [ 114.14239 , 22.582002 ],
' 锦上花园停车场 ': [ 114.142047 , 22.546511 ],
' 中国邮政储蓄银行(深圳东湖支行)-停车场 ': [ 114.147642 , 22.567695 ],
' 金色都汇-地下车库 ': [ 114.131906 , 22.546793 ],
' 联城酒店-停车场 ': [ 114.138653 , 22.547691 ],
' 水库新村-停车场 ': [ 114.146229 , 22.569045 ],
' 128大院-停车场 ': [ 114.128429 , 22.560435 ],
' 美景花园大厦-停车场 ': [ 114.128475 , 22.571174 ],
' 高标大厦-停车场 ': [ 114.136423 , 22.566266 ],
' 罗湖国防大厦-地下停车场 ': [ 114.127728 , 22.586106 ],
' 锦绣大厦-停车场 ': [ 114.138349 , 22.555455 ],
' 文星花园-停车场 ': [ 114.13487 , 22.547358 ],
' 中震大厦-停车场 ': [ 114.153199 , 22.551213 ],
' 布心广场-停车场 ': [ 114.147124 , 22.583553 ],
' 鹿鸣园-停车场 ': [ 114.13474 , 22.581976 ],
' 深圳市旭飞华达园-停车场 ': [ 114.136684 , 22.577121 ],
' 一品东门雅园-停车场 ': [ 114.133968 , 22.556143 ],
' 市场监督管理局罗湖分局-停车场 ': [ 114.150555 , 22.560752 ],
' 维也纳酒店(凤凰路店)-停车场 ': [ 114.140508 , 22.554 ],
' 华都园大厦-停车场 ': [ 114.129974 , 22.547993 ],
' 合正锦湖逸园-停车场 ': [ 114.130544 , 22.564291 ],
' 华丽园-停车场 ': [ 114.135529 , 22.565736 ],
' 凯悦华庭-地下车库 ': [ 114.133058 , 22.546191 ],
' 天景花园-停车场 ': [ 114.147852 , 22.567129 ],
' 雍翠华府-地下停车场 ': [ 114.128219 , 22.583962 ],
' 布心花园-停车场 ': [ 114.148777 , 22.580036 ],
' 罗湖区人民医院-地下停车场 ': [ 114.129114 , 22.54439 ],
' 怡泰中心-停车场 ': [ 114.134224 , 22.561044 ],
' 东湖丽苑-停车场 ': [ 114.144772 , 22.567526 ],
' 兴隆大厦-停车场 ': [ 114.126769 , 22.548661 ],
' 粤鹏大厦-停车场 ': [ 114.130372 , 22.547525 ],
' 广岭停车场 ': [ 114.161032 , 22.56218 ],
' 罗湖体育中心-停车场 ': [ 114.156475 , 22.56169 ],
' 雅园宾馆-停车场 ': [ 114.133489 , 22.561413 ],
' 海关布心生活区停车场 ': [ 114.149395 , 22.579558 ],
' 立新花园-地下车库 ': [ 114.126885 , 22.555253 ],
' 金溪大厦-停车场 ': [ 114.126596 , 22.559801 ],
' 黄贝岭村-停车场 ': [ 114.147546 , 22.553658 ],
' 鸿业苑-停车场 ': [ 114.140032 , 22.563595 ],
' 景园大厦-停车场 ': [ 114.14643 , 22.566956 ],
' 鸿昌广场-地下车库 ': [ 114.136946 , 22.550404 ],
' 华裕花园-停车场 ': [ 114.139129 , 22.552523 ],
' 电信大厦-停车场 ': [ 114.125978 , 22.550559 ],
' 深圳市新秀停车场 ': [ 114.149324 , 22.551113 ],
' 金通大厦-停车场 ': [ 114.140406 , 22.559205 ],
' 东深小区-停车场 ': [ 114.149991 , 22.57123 ],
' 君逸华府-停车场 ': [ 114.139683 , 22.582917 ],
' 丰湖大厦-停车场 ': [ 114.126575 , 22.582582 ],
' 湖贝新村-停车场 ': [ 114.134711 , 22.554161 ],
' 汇鑫花园-停车场 ': [ 114.141551 , 22.549012 ],
' 广发大厦-停车场 ': [ 114.131035 , 22.545307 ],
' 洪湖东岸-停车场 ': [ 114.129593 , 22.575829 ],
' 潮汕大厦-停车场 ': [ 114.134583 , 22.544897 ],
' 东湖宾馆-停车场 ': [ 114.151586 , 22.579907 ],
' 深业大厦-停车场 ': [ 114.136901 , 22.554274 ],
' 新世界鹿茵翠地-地下停车库 ': [ 114.167636 , 22.564137 ],
' 峰景台大厦-停车场 ': [ 114.146783 , 22.560416 ],
' 丹枫白露停车场 ': [ 114.145487 , 22.550538 ],
' 翠竹大厦-停车场 ': [ 114.136334 , 22.576737 ],
' 彩世界家园-停车场 ': [ 114.149402 , 22.58464 ],
' 市人民医院第2门诊部-停车场 ': [ 114.135252 , 22.562306 ],
' 聚龙大厦-地下停车场 ': [ 114.133785 , 22.559617 ],
' 阳光天地家园-停车场 ': [ 114.134072 , 22.573744 ],
' 海丽大厦停车场 ': [ 114.137963 , 22.556354 ],
' 桂都大厦-停车场 ': [ 114.131215 , 22.544239 ],
' 太阳岛大厦-停车场 ': [ 114.130574 , 22.547022 ],
' 华清园-停车场 ': [ 114.158113 , 22.56027 ],
' 三九大酒店-停车场 ': [ 114.145629 , 22.552259 ],
' 莲塘七区-停车场 ': [ 114.169224 , 22.565902 ],
' 鸿昌广场-停车场 ': [ 114.136703 , 22.550195 ],
' 名泰轩-停车场 ': [ 114.156798 , 22.556756 ],
' 东湖公园1号门-停车场 ': [ 114.150155 , 22.573373 ],
' 粤运大厦-地下停车场 ': [ 114.136883 , 22.546265 ],
' 景亿山庄-停车场 ': [ 114.149118 , 22.586365 ],
' 双御雅轩-地下车库 ': [ 114.133649 , 22.582619 ],
' 富基·PARK国际-停车场 ': [ 114.12657 , 22.58544 ],
' 宁水花园-停车场 ': [ 114.151535 , 22.568432 ],
' 庐峰翠苑-停车场 ': [ 114.143047 , 22.556698 ],
' 深圳中学-停车场 ': [ 114.128044 , 22.557247 ],
' 人民医院-停车场 ': [ 114.128055 , 22.544177 ],
' 翠盈嘉园-停车场 ': [ 114.129867 , 22.563539 ],
' 梧桐山物业管理-停车场 ': [ 114.201538 , 22.59502 ],
' 梧桐山物业管理-停车场 ': [ 114.202086 , 22.594776 ],
' 仙湖植物园-停车场 ': [ 114.185299 , 22.58924 ],
' 梧桐山-停车场 ': [ 114.202362 , 22.595291 ],
' 翠竹小区-停车场 ': [ 114.126705 , 22.590052 ],
' 停车场 ': [ 114.1276 , 22.588375 ],
' 港鹏新村-停车场 ': [ 114.139819 , 22.592046 ],
' 港鹏新村-停车场 ': [ 114.139879 , 22.592025 ],
' 翡翠园-绿映居停车场 ': [ 114.1438 , 22.590396 ],
' 草埔新村-停车场 ': [ 114.128331 , 22.592806 ],
' 绿映居-停车场 ': [ 114.144637 , 22.590547 ],
' 农牧小区-停车场 ': [ 114.139962 , 22.589205 ],
' 木棉岭小区-停车场 ': [ 114.127753 , 22.594138 ],
' 谱心苑停车场 ': [ 114.140078 , 22.593232 ],
' 心怡花园-地下车库 ': [ 114.144641 , 22.58886 ],
' 泰和花园-停车场 ': [ 114.144159 , 22.589544 ],
' 翡翠园-停车场 ': [ 114.143844 , 22.590503 ],
' 樟树布停车场 ': [ 114.163409 , 22.610073 ],
' 比华利山庄-停车场 ': [ 114.126085 , 22.594623 ],
' 金洲花园-停车场 ': [ 114.140755 , 22.593572 ],
' 山湖居-停车场 ': [ 114.147213 , 22.589285 ],
' 越众产业园-地面停车场 ': [ 114.113734 , 22.58995 ],
' 新屋吓村停车场 ': [ 114.121865 , 22.596532 ],
' 南深工业区-停车场 ': [ 114.11288 , 22.588785 ],
' 停车场 ': [ 114.125903 , 22.589695 ],
' 田园居别墅-停车场 ': [ 114.088545 , 22.588739 ],
' 共发达货运市场一期-停车场 ': [ 114.113158 , 22.589444 ],
' 青湖山庄-停车场 ': [ 114.113412 , 22.591192 ],
' 草埔大厦-停车场 ': [ 114.124781 , 22.589545 ],
' 金祥都市花园-停车场 ': [ 114.114494 , 22.591132 ],
' 置富公寓-停车场 ': [ 114.125339 , 22.5881 ],
' 深圳货运中心清水河货运市场-停车场 ': [ 114.119538 , 22.589352 ],
' 华景园-停车场 ': [ 114.183451 , 22.569973 ],
' 园福海鲜酒家-停车场 ': [ 114.181646 , 22.570882 ],
' 景福花园-停车场 ': [ 114.180945 , 22.569513 ],
' 合正锦园北区-地下停车场 ': [ 114.185232 , 22.569079 ],
' 鸿威·鸿景-翠峰停车场 ': [ 114.195289 , 22.562001 ],
' 仙桐馨苑-停车场 ': [ 114.177738 , 22.574228 ],
' 景福二期-停车场 ': [ 114.18186 , 22.569397 ],
' 停车场 ': [ 114.17674 , 22.571958 ],
' 祥和花园-地下停车场 ': [ 114.175008 , 22.568211 ],
' 莲塘花园-停车场 ': [ 114.179005 , 22.567772 ],
' 航天晴山月东区-车库 ': [ 114.194878 , 22.561195 ],
' 坳下停车场 ': [ 114.175517 , 22.571298 ],
' 航天晴山月西区-车库 ': [ 114.194195 , 22.561312 ],
' 振华苑-停车场 ': [ 114.186202 , 22.56384 ],
' 鹏兴花园-停车场 ': [ 114.174078 , 22.569991 ],
' 莲塘工业七小区-停车场 ': [ 114.18343 , 22.564072 ],
' 梧桐山新居-停车场 ': [ 114.181439 , 22.573602 ],
' 华景园北区-停车场 ': [ 114.183399 , 22.569974 ],
' 聚宝花园-停车场 ': [ 114.181089 , 22.566527 ],
' 翠榕花园-停车场 ': [ 114.181277 , 22.575361 ],
' 惠兰雅居-停车场 ': [ 114.188908 , 22.56573 ],
' 东方凤雅台-停车场 ': [ 114.187219 , 22.565638 ],
' 仙桐体育公园-停车场 ': [ 114.191228 , 22.566631 ],
' 仙湖公馆-停车场 ': [ 114.17224 , 22.572704 ],
' 仙桐体育公园-停车场 ': [ 114.190988 , 22.566907 ],
' 仙湖枫景-停车场 ': [ 114.17684 , 22.571458 ],
' 仙湖植物园-停车场 ': [ 114.188047 , 22.583921 ],
' 深圳仙湖植物园-多层停车场 ': [ 114.175159 , 22.575115 ],
' 特力物业管理公司布心管理处停车场 ': [ 114.143925 , 22.584379 ],
' 华达园二期-地下停车场 ': [ 114.136326 , 22.579757 ],
' 六星汽车园-停车场 ': [ 114.154115 , 22.55858 ],
' 宝泉庄-停车场 ': [ 114.118609 , 22.557832 ],
' 华润万象城 ': [ 114.115675 , 22.547287 ],
' 京基一百大厦 ': [ 114.11311 , 22.549356 ],
' 人民医院第二门诊部 ': [ 114.135183 , 22.562703 ],
' 深圳大剧院 ': [ 114.112493 , 22.548074 ],
' 百仕达花园二期 ': [ 114.139754 , 22.579267 ],
' 百仕达花园一期 ': [ 114.140149 , 22.57582 ],
' 鸿翔花园 ': [ 114.112046 , 22.561438 ],
' 金翠园 ': [ 114.13473 , 22.56748 ],
' 鹏兴花园 ': [ 114.169348 , 22.571528 ],
' 鹏兴花园二期 ': [ 114.17021 , 22.56811 ],
' 鸿景翠峰花园 ': [ 114.195875 , 22.56232 ],
' 龙园山庄 ': [ 114.117569 , 22.593994 ],
' 武警生活区银龙花园 ': [ 114.10487 , 22.57604 ],
' 中信星光明庭管理处 ': [ 114.129459 , 22.561827 ],
' 百汇大厦 ': [ 114.113339 , 22.561797 ],
' 柏丽花园 ': [ 114.133458 , 22.568758 ],
' 宝丽大厦 ': [ 114.11695 , 22.553417 ],
' 缤纷时代家园 ': [ 114.131819 , 22.557171 ],
' 翠拥华庭 ': [ 114.136905 , 22.569322 ],
' 东翠花园 ': [ 114.10372 , 22.575367 ],
' 鹤围村 ': [ 114.119005 , 22.59153 ],
' 红围坊停车场 ': [ 114.119224 , 22.551483 ],
' 鸿翠苑 ': [ 114.128152 , 22.588855 ],
' 嘉年华名苑 ': [ 114.128349 , 22.55618 ],
' 金园花园 ': [ 114.116194 , 22.560786 ],
' 半岛大厦 ': [ 114.123596 , 22.552334 ],
' 宝琳珠宝交易中心 ': [ 114.130094 , 22.572702 ],
' 蔡屋围发展大厦 ': [ 114.115152 , 22.560996 ],
' 东门天地大厦 ': [ 114.128255 , 22.555801 ],
' 工人文化宫 ': [ 114.122586 , 22.553094 ],
' 公路局大院 ': [ 114.135498 , 22.568072 ],
' 红桂大厦 ': [ 114.114116 , 22.556744 ],
' 金湖文化中心 ': [ 114.091453 , 22.57647 ],
' 俊园大厦 ': [ 114.136886 , 22.557781 ],
' 农行大厦 ': [ 114.112728 , 22.547948 ],
' 孙逸仙心血管医院停车场 ': [ 114.135751 , 22.562661 ],
' 雅园宾馆 ': [ 114.133489 , 22.56141 ],
' 东晓综合市场 ': [ 114.14259 , 22.578024 ],
' 国家珠宝检测中心 ': [ 114.13441 , 22.566531 ],
' 合作金融大厦 ': [ 114.123911 , 22.54983 ],
' 华瑞大厦 ': [ 114.115844 , 22.542512 ],
' 金丰城 ': [ 114.116493 , 22.547345 ],
' 金融中心 ': [ 114.113114 , 22.545977 ],
' 京基晶都酒店 ': [ 114.13338 , 22.555972 ],
' 丽晶大厦 ': [ 114.113848 , 22.5458 ],
' 荔景大厦 ': [ 114.111499 , 22.551282 ],
' 深业大厦 ': [ 114.136901 , 22.55427 ],
' 物资大厦 ': [ 114.127522 , 22.560643 ],
' 信托大厦 ': [ 114.111713 , 22.552004 ],
' 永新商业城 ': [ 114.123378 , 22.550572 ],
' 朝花大厦 ': [ 114.137105 , 22.554138 ],
' 大信大厦 ': [ 114.117187 , 22.55566 ],
' 东方大厦 ': [ 114.130766 , 22.557891 ],
' 东方华都 ': [ 114.135247 , 22.557188 ],
' 桂花大厦 ': [ 114.119239 , 22.553402 ],
' 洪涛大厦 ': [ 114.11528 , 22.561487 ],
' 鸿基大厦 ': [ 114.127752 , 22.551419 ],
' 湖景大厦 ': [ 114.130128 , 22.571281 ],
' 湖臻大厦 ': [ 114.131926 , 22.5517 ],
' 华安国际大酒店 ': [ 114.117016 , 22.550429 ],
' 华丽园大厦 ': [ 114.13564 , 22.565724 ],
' 华隆园 ': [ 114.133254 , 22.557172 ],
' 化工大厦 ': [ 114.136198 , 22.574428 ],
' 鲲田商贸停车场 ': [ 114.137171 , 22.554328 ],
' 联兴大厦 ': [ 114.136905 , 22.555541 ],
' 名都大厦 ': [ 114.136144 , 22.556247 ],
' 永通大厦 ': [ 114.127621 , 22.561704 ],
' 长虹大厦 ': [ 114.114606 , 22.561329 ],
' 振业大厦 ': [ 114.11769 , 22.551051 ],
' 中航凯特公寓 ': [ 114.115114 , 22.557724 ],
' 中深石化大厦 ': [ 114.135813 , 22.58266 ],
' 世濠大厦 ': [ 114.125653 , 22.554879 ],
' 天元大厦 ': [ 114.11776 , 22.556607 ],
' 同乐大厦 ': [ 114.131229 , 22.562051 ],
' 万达丰大厦 ': [ 114.131096 , 22.558109 ],
' 万山珠宝工业园 ': [ 114.134991 , 22.573682 ],
' 文锦广场 ': [ 114.131853 , 22.564538 ],
' 新白马 ': [ 114.12678 , 22.553795 ],
' 银都大厦 ': [ 114.12729 , 22.550748 ],
' 翠景山庄 ': [ 114.13433 , 22.584036 ],
' 电影大厦 ': [ 114.120013 , 22.551416 ],
' 东悦名轩 ': [ 114.129421 , 22.557403 ],
' 都市名园 ': [ 114.115274 , 22.546433 ],
' 都心名苑管理处 ': [ 114.132535 , 22.555328 ],
' 翡翠公寓 ': [ 114.130713 , 22.567266 ],
' 丰园酒店 ': [ 114.130616 , 22.552875 ],
' 桂龙家园 ': [ 114.120308 , 22.56021 ],
' 桂苑城市花园 ': [ 114.119662 , 22.557805 ],
' 国都花园 ': [ 114.117685 , 22.554795 ],
' 合正星园 ': [ 114.132333 , 22.571607 ],
' 鸿园居 ': [ 114.140298 , 22.580693 ],
' 华通大厦 ': [ 114.116589 , 22.561618 ],
' 惠名花园 ': [ 114.190197 , 22.561637 ],
' 建设集团大院 ': [ 114.111576 , 22.56084 ],
' 金碧苑 ': [ 114.095399 , 22.577472 ],
' 鹏兴花园三期 ': [ 114.174326 , 22.567487 ],
' 沁芳名苑 ': [ 114.140777 , 22.563975 ],
};

var data_parking = [
{name:' 万城公司工业区-停车场 ', value: 70 },
{name:' 罗湖口岸交通楼-停车场 ', value: 70 },
{name:' 东方大厦-停车场 ', value: 50 },
{name:' 黄贝岭华侨新村-停车场 ', value: 100 },
{name:' 中医院第1门诊部-停车场 ', value: 100 },
{name:' 万象城-地下停车场 ', value: 80 },
{name:' 香格里拉酒店-停车场 ', value: 100 },
{name:' 国贸商业大厦-停车场 ', value: 80 },
{name:' 中泰来大酒店-停车场 ', value: 80 },
{name:' 世界金融中心-停车场 ', value: 50 },
{name:' 国贸大厦-停车场 ', value: 80 },
{name:' 深圳华润万象城二期-地下停车场 ', value: 80 },
{name:' 金稻田公寓-停车场 ', value: 90 },
{name:' 翠怡苑-停车场 ', value: 70 },
{name:' 捷泰公寓写字楼-停车场 ', value: 70 },
{name:' 荔景山色花园-地下二层停车场 ', value: 70 },
{name:' 翠岭苑-停车场 ', value: 70 },
{name:' 华港新村-停车场 ', value: 70 },
{name:' 停车场 ', value: 70 },
{name:' 绿景山庄-停车场 ', value: 70 },
{name:' 翠山路77号大院停车场 ', value: 70 },
{name:' 避风塘-停车场 ', value: 90 },
{name:' 停车场 ', value: 90 },
{name:' 草埔西鹤围村-停车场 ', value: 70 },
{name:' 龙园山庄-地下车库 ', value: 70 },
{name:' 龙园山庄-停车场 ', value: 70 },
{name:' 宝明花园-停车场 ', value: 70 },
{name:' 青海山庄-停车场 ', value: 70 },
{name:' 银湖国际会议中心-停车场 ', value: 70 },
{name:' 紫荆花园-停车场 ', value: 90 },
{name:' 停车场 ', value: 70 },
{name:' 鹏兴花园五期-停车场 ', value: 70 },
{name:' 航天晴山月名园-地下停车场 ', value: 70 },
{name:' 华景园南区-停车场 ', value: 70 },
{name:' 惠名花园-停车场 ', value: 70 },
{name:' 停车场 ', value: 90 },
{name:' 金色年华家园-地下停车场 ', value: 60 },
{name:' 港莲北村-停车场 ', value: 60 },
{name:' 聚福花园-停车场 ', value: 60 },
{name:' 天越翔园-停车场 ', value: 60 },
{name:' 仙湖山庄-物业停车场 ', value: 70 },
{name:' 深圳国威电子有限公司-停车场 ', value: 90 },
{name:' 城市东座-停车场 ', value: 90 },
{name:' 鹏兴花园一期-停车场 ', value: 70 },
{name:' 仙桐御景-地下停车场 ', value: 70 },
{name:' 深圳仙湖植物园-停车场 ', value: 70 },
{name:' 航天晴山月名园-停车场 ', value: 70 },
{name:' 万科-东方尊峪停车场 ', value: 70 },
{name:' 仙湖植物园-停车场 ', value: 70 },
{name:' 聚宝华府-地下停车场 ', value: 90 },
{name:' 桐景花园-停车场 ', value: 90 },
{name:' 熙悦庭菜馆-停车场 ', value: 100 },
{name:' 丹枫·白露城东1号-地下车库 ', value: 70 },
{name:' 翡翠·星空-地下车库 ', value: 50 },
{name:' 停车场 ', value: 70 },
{name:' 停车场 ', value: 70 },
{name:' 独树村综合楼-停车场 ', value: 70 },
{name:' 停车场 ', value: 100 },
{name:' 停车场 ', value: 70 },
{name:' 工纺大厦-地下停车场 ', value: 100 },
{name:' 6号大院-停车场 ', value: 100 },
{name:' 6号大院-停车场 ', value: 100 },
{name:' 松泉住宅区-停车场 ', value: 70 },
{name:' 松泉住宅区停车场 ', value: 70 },
{name:' 商业停车场 ', value: 50 },
{name:' 湖滨阁-西停车场 ', value: 70 },
{name:' 洪湖二街四号大院-停车场 ', value: 70 },
{name:' 金秀停车场 ', value: 70 },
{name:' 罗湖创意文化广场-停车场 ', value: 100 },
{name:' 鹏城花园北区-停车场 ', value: 70 },
{name:' 粤海珠宝综合广场-停车场 ', value: 70 },
{name:' 布心花园-停车场 ', value: 70 },
{name:' 自来水宿舍-停车场 ', value: 100 },
{name:' 中国物贸大厦-地下停车场 ', value: 100 },
{name:' 文锦南路小区-停车场 ', value: 50 },
{name:' 文锦渡边检大厦-停车场 ', value: 70 },
{name:' 停车场 ', value: 70 },
{name:' 东莞外贸大厦-停车场 ', value: 80 },
{name:' 文锦渡海关生活区-停车场 ', value: 100 },
{name:' 鹏基西岭停车场 ', value: 70 },
{name:' 洪湖二街40号大院-停车场 ', value: 70 },
{name:' 麟腾苑-停车场 ', value: 70 },
{name:' 停车场 ', value: 70 },
{name:' 金迪名苑-地下停车场 ', value: 70 },
{name:' 停车场 ', value: 50 },
{name:' 百仕达花园四期-停车场 ', value: 70 },
{name:' 万事达酒店(深圳太宁店)-地下停车场 ', value: 70 },
{name:' 昇逸酒店-停车场 ', value: 100 },
{name:' 城东小区-停车场 ', value: 100 },
{name:' 停车场 ', value: 100 },
{name:' 金通大厦停车场-出入口 ', value: 70 },
{name:' 华清园-地下车库 ', value: 70 },
{name:' 深业大厦-地下停车场 ', value: 100 },
{name:' 深港新村管理处停车场 ', value: 70 },
{name:' 湖滨阁-北停车场 ', value: 70 },
{name:' 海富花园私家车场 ', value: 50 },
{name:' 中国物贸大厦-停车场 ', value: 100 },
{name:' 罗湖区人民检察院地下车库 ', value: 70 },
{name:' 停车场 ', value: 70 },
{name:' 瑞鹏大厦停车场(入口) ', value: 80 },
{name:' 万事达名苑-停车场 ', value: 70 },
{name:' 鸿业苑·名豪居-停车场 ', value: 70 },
{name:' 百仕达花园二期-三号地下停车场 ', value: 70 },
{name:' 鸿波电信大厦-地下停车场 ', value: 50 },
{name:' 新港鸿花园-停车场 ', value: 70 },
{name:' 锦星花园-东停车场 ', value: 50 },
{name:' 森威大厦-地下停车库 ', value: 50 },
{name:' 湖贝路旧区居民委员会-停车场 ', value: 100 },
{name:' 中国银行停车场 ', value: 50 },
{name:' 麟腾苑-地下停车场 ', value: 70 },
{name:' 深圳市人民医院第2门诊部-停车场 ', value: 50 },
{name:' 鸿昌广场-停车场 ', value: 100 },
{name:' 祥祺鹏大厦-停车场 ', value: 50 },
{name:' 联城证券大厦-停车场 ', value: 100 },
{name:' 美食大观园-停车场 ', value: 70 },
{name:' 翠田工业区-停车场 ', value: 70 },
{name:' 华盐股份有限公司-地面停车场 ', value: 50 },
{name:' 百仕达花园一期B区中心组团停车场 ', value: 70 },
{name:' 化工工业大厦-停车场 ', value: 70 },
{name:' 新王朝酒店-停车场 ', value: 50 },
{name:' 深圳古玩城-停车场 ', value: 70 },
{name:' 湖景花园-停车场 ', value: 70 },
{name:' 金安大厦-停车场 ', value: 100 },
{name:' 罗芳大酒店-停车场 ', value: 70 },
{name:' 东方都会-地下车库 ', value: 70 },
{name:' 东湖豪庭-停车场 ', value: 70 },
{name:' 停车场 ', value: 100 },
{name:' 洪湖春天地下车库(入口) ', value: 50 },
{name:' 嘉湖新都-地下停车场 ', value: 50 },
{name:' 碧波花园-停车场 ', value: 70 },
{name:' 特力大厦-地下停车场 ', value: 70 },
{name:' 凤山大厦-停车场 ', value: 100 },
{name:' 大地花园-停车场 ', value: 70 },
{name:' 布心新苑商务中心-智能停车库 ', value: 70 },
{name:' 东门金融大厦立体车库停车场 ', value: 100 },
{name:' 东安花园-停车场 ', value: 50 },
{name:' 电视广播大院-停车场 ', value: 70 },
{name:' 五矿大厦-停车场 ', value: 80 },
{name:' 贝丽花园-停车场 ', value: 70 },
{name:' 向西大厦-地下车库 ', value: 100 },
{name:' 停车场 ', value: 70 },
{name:' 深运大厦-停车场 ', value: 100 },
{name:' 深圳盐业大院停车场 ', value: 50 },
{name:' 华丽西村-停车场 ', value: 50 },
{name:' 湖贝东门市场大厦-停车场 ', value: 100 },
{name:' 停车场 ', value: 50 },
{name:' 老地方酒店-停车场 ', value: 80 },
{name:' 广西大厦-停车场 ', value: 80 },
{name:' 万科彩园-停车场 ', value: 50 },
{name:' 怡景花园-停车场 ', value: 70 },
{name:' 翠山花半里别馆-地下一层停车场 ', value: 70 },
{name:' 百仕达花园二期-停车场 ', value: 70 },
{name:' 逸湖居-地下停车场 ', value: 70 },
{name:' 兴华苑-停车场 ', value: 70 },
{name:' 潮逸轩-停车场 ', value: 70 },
{name:' 新南滨大楼-停车场 ', value: 70 },
{name:' 富驿时尚酒店-专用停车场 ', value: 50 },
{name:' 盛华大厦-停车场 ', value: 100 },
{name:' 文华大厦-停车场 ', value: 50 },
{name:' 翠山工业区-停车场 ', value: 70 },
{name:' 金迪名苑-停车场 ', value: 70 },
{name:' 锦上花园停车场 ', value: 70 },
{name:' 中国邮政储蓄银行(深圳东湖支行)-停车场 ', value: 70 },
{name:' 金色都汇-地下车库 ', value: 80 },
{name:' 联城酒店-停车场 ', value: 50 },
{name:' 水库新村-停车场 ', value: 50 },
{name:' 128大院-停车场 ', value: 50 },
{name:' 美景花园大厦-停车场 ', value: 70 },
{name:' 高标大厦-停车场 ', value: 50 },
{name:' 罗湖国防大厦-地下停车场 ', value: 70 },
{name:' 锦绣大厦-停车场 ', value: 100 },
{name:' 文星花园-停车场 ', value: 50 },
{name:' 中震大厦-停车场 ', value: 70 },
{name:' 布心广场-停车场 ', value: 50 },
{name:' 鹿鸣园-停车场 ', value: 70 },
{name:' 深圳市旭飞华达园-停车场 ', value: 70 },
{name:' 一品东门雅园-停车场 ', value: 100 },
{name:' 市场监督管理局罗湖分局-停车场 ', value: 70 },
{name:' 维也纳酒店(凤凰路店)-停车场 ', value: 100 },
{name:' 华都园大厦-停车场 ', value: 80 },
{name:' 合正锦湖逸园-停车场 ', value: 50 },
{name:' 华丽园-停车场 ', value: 50 },
{name:' 凯悦华庭-地下车库 ', value: 100 },
{name:' 天景花园-停车场 ', value: 70 },
{name:' 雍翠华府-地下停车场 ', value: 70 },
{name:' 布心花园-停车场 ', value: 70 },
{name:' 罗湖区人民医院-地下停车场 ', value: 80 },
{name:' 怡泰中心-停车场 ', value: 50 },
{name:' 东湖丽苑-停车场 ', value: 70 },
{name:' 兴隆大厦-停车场 ', value: 80 },
{name:' 粤鹏大厦-停车场 ', value: 80 },
{name:' 广岭停车场 ', value: 70 },
{name:' 罗湖体育中心-停车场 ', value: 70 },
{name:' 雅园宾馆-停车场 ', value: 50 },
{name:' 海关布心生活区停车场 ', value: 70 },
{name:' 立新花园-地下车库 ', value: 100 },
{name:' 金溪大厦-停车场 ', value: 70 },
{name:' 黄贝岭村-停车场 ', value: 70 },
{name:' 鸿业苑-停车场 ', value: 70 },
{name:' 景园大厦-停车场 ', value: 70 },
{name:' 鸿昌广场-地下车库 ', value: 100 },
{name:' 华裕花园-停车场 ', value: 100 },
{name:' 电信大厦-停车场 ', value: 80 },
{name:' 深圳市新秀停车场 ', value: 70 },
{name:' 金通大厦-停车场 ', value: 70 },
{name:' 东深小区-停车场 ', value: 70 },
{name:' 君逸华府-停车场 ', value: 70 },
{name:' 丰湖大厦-停车场 ', value: 70 },
{name:' 湖贝新村-停车场 ', value: 100 },
{name:' 汇鑫花园-停车场 ', value: 50 },
{name:' 广发大厦-停车场 ', value: 80 },
{name:' 洪湖东岸-停车场 ', value: 70 },
{name:' 潮汕大厦-停车场 ', value: 50 },
{name:' 东湖宾馆-停车场 ', value: 70 },
{name:' 深业大厦-停车场 ', value: 100 },
{name:' 新世界鹿茵翠地-地下停车库 ', value: 70 },
{name:' 峰景台大厦-停车场 ', value: 70 },
{name:' 丹枫白露停车场 ', value: 70 },
{name:' 翠竹大厦-停车场 ', value: 70 },
{name:' 彩世界家园-停车场 ', value: 50 },
{name:' 市人民医院第2门诊部-停车场 ', value: 50 },
{name:' 聚龙大厦-地下停车场 ', value: 70 },
{name:' 阳光天地家园-停车场 ', value: 70 },
{name:' 海丽大厦停车场 ', value: 100 },
{name:' 桂都大厦-停车场 ', value: 80 },
{name:' 太阳岛大厦-停车场 ', value: 80 },
{name:' 华清园-停车场 ', value: 70 },
{name:' 三九大酒店-停车场 ', value: 50 },
{name:' 莲塘七区-停车场 ', value: 70 },
{name:' 鸿昌广场-停车场 ', value: 100 },
{name:' 名泰轩-停车场 ', value: 70 },
{name:' 东湖公园1号门-停车场 ', value: 50 },
{name:' 粤运大厦-地下停车场 ', value: 70 },
{name:' 景亿山庄-停车场 ', value: 70 },
{name:' 双御雅轩-地下车库 ', value: 70 },
{name:' 富基·PARK国际-停车场 ', value: 70 },
{name:' 宁水花园-停车场 ', value: 70 },
{name:' 庐峰翠苑-停车场 ', value: 50 },
{name:' 深圳中学-停车场 ', value: 50 },
{name:' 人民医院-停车场 ', value: 80 },
{name:' 翠盈嘉园-停车场 ', value: 50 },
{name:' 梧桐山物业管理-停车场 ', value: 70 },
{name:' 梧桐山物业管理-停车场 ', value: 70 },
{name:' 仙湖植物园-停车场 ', value: 70 },
{name:' 梧桐山-停车场 ', value: 70 },
{name:' 翠竹小区-停车场 ', value: 90 },
{name:' 停车场 ', value: 70 },
{name:' 港鹏新村-停车场 ', value: 70 },
{name:' 港鹏新村-停车场 ', value: 70 },
{name:' 翡翠园-绿映居停车场 ', value: 70 },
{name:' 草埔新村-停车场 ', value: 70 },
{name:' 绿映居-停车场 ', value: 70 },
{name:' 农牧小区-停车场 ', value: 70 },
{name:' 木棉岭小区-停车场 ', value: 70 },
{name:' 谱心苑停车场 ', value: 70 },
{name:' 心怡花园-地下车库 ', value: 70 },
{name:' 泰和花园-停车场 ', value: 70 },
{name:' 翡翠园-停车场 ', value: 70 },
{name:' 樟树布停车场 ', value: 70 },
{name:' 比华利山庄-停车场 ', value: 70 },
{name:' 金洲花园-停车场 ', value: 70 },
{name:' 山湖居-停车场 ', value: 70 },
{name:' 越众产业园-地面停车场 ', value: 70 },
{name:' 新屋吓村停车场 ', value: 70 },
{name:' 南深工业区-停车场 ', value: 70 },
{name:' 停车场 ', value: 90 },
{name:' 田园居别墅-停车场 ', value: 70 },
{name:' 共发达货运市场一期-停车场 ', value: 70 },
{name:' 青湖山庄-停车场 ', value: 70 },
{name:' 草埔大厦-停车场 ', value: 90 },
{name:' 金祥都市花园-停车场 ', value: 70 },
{name:' 置富公寓-停车场 ', value: 90 },
{name:' 深圳货运中心清水河货运市场-停车场 ', value: 90 },
{name:' 华景园-停车场 ', value: 70 },
{name:' 园福海鲜酒家-停车场 ', value: 70 },
{name:' 景福花园-停车场 ', value: 90 },
{name:' 合正锦园北区-地下停车场 ', value: 70 },
{name:' 鸿威·鸿景-翠峰停车场 ', value: 70 },
{name:' 仙桐馨苑-停车场 ', value: 70 },
{name:' 景福二期-停车场 ', value: 90 },
{name:' 停车场 ', value: 90 },
{name:' 祥和花园-地下停车场 ', value: 90 },
{name:' 莲塘花园-停车场 ', value: 60 },
{name:' 航天晴山月东区-车库 ', value: 70 },
{name:' 坳下停车场 ', value: 90 },
{name:' 航天晴山月西区-车库 ', value: 70 },
{name:' 振华苑-停车场 ', value: 70 },
{name:' 鹏兴花园-停车场 ', value: 90 },
{name:' 莲塘工业七小区-停车场 ', value: 70 },
{name:' 梧桐山新居-停车场 ', value: 70 },
{name:' 华景园北区-停车场 ', value: 70 },
{name:' 聚宝花园-停车场 ', value: 90 },
{name:' 翠榕花园-停车场 ', value: 70 },
{name:' 惠兰雅居-停车场 ', value: 70 },
{name:' 东方凤雅台-停车场 ', value: 70 },
{name:' 仙桐体育公园-停车场 ', value: 70 },
{name:' 仙湖公馆-停车场 ', value: 70 },
{name:' 仙桐体育公园-停车场 ', value: 70 },
{name:' 仙湖枫景-停车场 ', value: 90 },
{name:' 仙湖植物园-停车场 ', value: 70 },
{name:' 深圳仙湖植物园-多层停车场 ', value: 70 },
{name:' 特力物业管理公司布心管理处停车场 ', value: 70 },
{name:' 华达园二期-地下停车场 ', value: 70 },
{name:' 六星汽车园-停车场 ', value: 70 },
{name:' 宝泉庄-停车场 ', value: 50 },
{name:' 华润万象城 ', value: 100 },
{name:' 京基一百大厦 ', value: 100 },
{name:' 人民医院第二门诊部 ', value: 50 },
{name:' 深圳大剧院 ', value: 100 },
{name:' 百仕达花园二期 ', value: 70 },
{name:' 百仕达花园一期 ', value: 70 },
{name:' 鸿翔花园 ', value: 70 },
{name:' 金翠园 ', value: 50 },
{name:' 鹏兴花园 ', value: 70 },
{name:' 鹏兴花园二期 ', value: 70 },
{name:' 鸿景翠峰花园 ', value: 70 },
{name:' 龙园山庄 ', value: 70 },
{name:' 武警生活区银龙花园 ', value: 70 },
{name:' 中信星光明庭管理处 ', value: 50 },
{name:' 百汇大厦 ', value: 50 },
{name:' 柏丽花园 ', value: 70 },
{name:' 宝丽大厦 ', value: 100 },
{name:' 缤纷时代家园 ', value: 50 },
{name:' 翠拥华庭 ', value: 70 },
{name:' 东翠花园 ', value: 70 },
{name:' 鹤围村 ', value: 90 },
{name:' 红围坊停车场 ', value: 100 },
{name:' 鸿翠苑 ', value: 70 },
{name:' 嘉年华名苑 ', value: 100 },
{name:' 金园花园 ', value: 50 },
{name:' 半岛大厦 ', value: 100 },
{name:' 宝琳珠宝交易中心 ', value: 50 },
{name:' 蔡屋围发展大厦 ', value: 50 },
{name:' 东门天地大厦 ', value: 100 },
{name:' 工人文化宫 ', value: 50 },
{name:' 公路局大院 ', value: 50 },
{name:' 红桂大厦 ', value: 100 },
{name:' 金湖文化中心 ', value: 70 },
{name:' 俊园大厦 ', value: 50 },
{name:' 农行大厦 ', value: 100 },
{name:' 孙逸仙心血管医院停车场 ', value: 50 },
{name:' 雅园宾馆 ', value: 50 },
{name:' 东晓综合市场 ', value: 70 },
{name:' 国家珠宝检测中心 ', value: 50 },
{name:' 合作金融大厦 ', value: 80 },
{name:' 华瑞大厦 ', value: 50 },
{name:' 金丰城 ', value: 100 },
{name:' 金融中心 ', value: 50 },
{name:' 京基晶都酒店 ', value: 50 },
{name:' 丽晶大厦 ', value: 100 },
{name:' 荔景大厦 ', value: 100 },
{name:' 深业大厦 ', value: 100 },
{name:' 物资大厦 ', value: 50 },
{name:' 信托大厦 ', value: 100 },
{name:' 永新商业城 ', value: 80 },
{name:' 朝花大厦 ', value: 100 },
{name:' 大信大厦 ', value: 100 },
{name:' 东方大厦 ', value: 50 },
{name:' 东方华都 ', value: 100 },
{name:' 桂花大厦 ', value: 50 },
{name:' 洪涛大厦 ', value: 50 },
{name:' 鸿基大厦 ', value: 80 },
{name:' 湖景大厦 ', value: 70 },
{name:' 湖臻大厦 ', value: 50 },
{name:' 华安国际大酒店 ', value: 100 },
{name:' 华丽园大厦 ', value: 50 },
{name:' 华隆园 ', value: 50 },
{name:' 化工大厦 ', value: 70 },
{name:' 鲲田商贸停车场 ', value: 100 },
{name:' 联兴大厦 ', value: 100 },
{name:' 名都大厦 ', value: 100 },
{name:' 永通大厦 ', value: 50 },
{name:' 长虹大厦 ', value: 50 },
{name:' 振业大厦 ', value: 100 },
{name:' 中航凯特公寓 ', value: 100 },
{name:' 中深石化大厦 ', value: 70 },
{name:' 世濠大厦 ', value: 100 },
{name:' 天元大厦 ', value: 50 },
{name:' 同乐大厦 ', value: 50 },
{name:' 万达丰大厦 ', value: 50 },
{name:' 万山珠宝工业园 ', value: 70 },
{name:' 文锦广场 ', value: 50 },
{name:' 新白马 ', value: 80 },
{name:' 银都大厦 ', value: 80 },
{name:' 翠景山庄 ', value: 70 },
{name:' 电影大厦 ', value: 100 },
{name:' 东悦名轩 ', value: 50 },
{name:' 都市名园 ', value: 100 },
{name:' 都心名苑管理处 ', value: 100 },
{name:' 翡翠公寓 ', value: 70 },
{name:' 丰园酒店 ', value: 50 },
{name:' 桂龙家园 ', value: 70 },
{name:' 桂苑城市花园 ', value: 50 },
{name:' 国都花园 ', value: 100 },
{name:' 合正星园 ', value: 50 },
{name:' 鸿园居 ', value: 70 },
{name:' 华通大厦 ', value: 50 },
{name:' 惠名花园 ', value: 70 },
{name:' 建设集团大院 ', value: 50 },
{name:' 金碧苑 ', value: 70 },
{name:' 鹏兴花园三期 ', value: 90 },
{name:' 沁芳名苑 ', value: 70 },
];

var convertData = function(data, num) {
    var res = [];
    for (var i = 0; i < data.length; i++) {
		if (data[i].value == num){
			var geoCoord = geoCoordMap[data[i].name];
			if (geoCoord) {
                res.push({
                    name: data[i].name,
                    value: geoCoord.concat(data[i].value)
                });

            }
	    }
    }
    return res;
};

console.log(convertData(data_parking));

var dom = document.getElementById("container");
var myChart = echarts.init(dom);
var app = {};
option = null;
app.title = '深圳停车场/交通流 - 线特效';

/*首先加载地图底板*/
    option = {
    bmap: {
        center: [114.135751 , 22.562661],
        zoom: 15,
        roam: true,
        mapStyle: {
            styleJson: [
                {
                    'featureType': 'land',     //调整土地颜色
                    'elementType': 'geometry',
                    'stylers': {
                        //'color': '#323c48'
						'color': '#000000'
                    }
                },
                {
                    'featureType': 'building',   //调整建筑物颜色
                    'elementType': 'geometry',
                    'stylers': {
                        //'color': '#2c343c'
						'color': '#000000'
                    }
                },
                {
                    'featureType': 'building',   //调整建筑物标签是否可视
                    'elementType': 'labels',
                    'stylers': {
                        'visibility': 'off'
                    }
                },
                {
                    'featureType': 'highway',     //调整高速道路颜色
                    'elementType': 'geometry',
                    'stylers': {
                        //'color': '#6e7074'
						'color': '#999999'
                    }
                },
                {
                    'featureType': 'highway',    //调整高速名字是否可视
                    'elementType': 'labels',
                    'stylers': {
                        'visibility': 'on'
                    }
                },
                {
                    'featureType': 'arterial',   //调整一些干道颜色
                    'elementType': 'geometry',
                    'stylers': {
                        //'color':'#2a333d'
						'color': '#999999'
                    }
                },
                {
                    'featureType': 'arterial',
                    'elementType': 'labels',
                    'stylers': {
                        'visibility': 'off'
                    }
                },
                {
                    'featureType': 'green',
                    'elementType': 'geometry',
                    'stylers': {
                        'visibility': 'off'
                    }
                },
                { 
                    'featureType': 'water',
                    'elementType': 'geometry',
                    'stylers': {
                        //'color': '#404a59'
						'color': '#2a333d'
                    }
                },
                {
                    'featureType': 'subway',    //调整地铁颜色
                    'elementType': 'geometry.stroke',
                    'stylers': {
                        'color': '#003051'
                    }
                },
                {
                    'featureType': 'subway',
                    'elementType': 'labels',
                    'stylers': {
                        'visibility': 'off'
                    }
                },
                {
                    'featureType': 'railway',
                    'elementType': 'geometry',
                    'stylers': {
                        'visibility': 'off'
                    }
                },
                {
                    'featureType': 'railway',
                    'elementType': 'labels',
                    'stylers': {
                        'visibility': 'off'
                    }
                },
                {
                    'featureType': 'all',     //调整所有的标签的边缘颜色
                    'elementType': 'labels.text.stroke',
                    'stylers': {
                        'color': '#313131'
                    }
                },
                {
                    'featureType': 'all',     //调整所有标签的填充颜色
                    'elementType': 'labels.text.fill',
                    'stylers': {
                        'color': '#FFFFFF'
                    }
                },
                {
                    'featureType': 'manmade',   
                    'elementType': 'geometry',
                    'stylers': {
                        'visibility': 'off'
                    }
                },
                {
                    'featureType': 'manmade',
                    'elementType': 'labels',
                    'stylers': {
                        'visibility': 'off'
                    }
                },
                {
                    'featureType': 'local',
                    'elementType': 'geometry',
                    'stylers': {
                        'visibility': 'off'
                    }
                },
                {
                    'featureType': 'local',
                    'elementType': 'labels',
                    'stylers': {
                        'visibility': 'off'
                    }
                },
                {
                    'featureType': 'subway',
                    'elementType': 'geometry',
                    'stylers': {
                        'lightness': -65
                    }
                },
                {
                    'featureType': 'railway',
                    'elementType': 'all',
                    'stylers': {
                        'lightness': -40
                    }
                },
                {
                    'featureType': 'boundary',
                    'elementType': 'geometry',
                    'stylers': {
                        'color': '#8b8787',
                        'weight': '1',
                        'lightness': -29
                    }
                }
			]
        }
    },

	tooltip : {
        trigger: 'item'
    },
	legend: {
        left: 'right',
		y: 'bottom',
        data: ['停车场类型：','第一类停车场', '第二类停车场', '第三类停车场', '第四类停车场', '第五类停车场', '第六类停车场'],
        textStyle: {
            color: '#ccc'
        }
    },
	/*
	visualMap: { //图例值控制
        min: 50,
        max: 100,
        calculable: true,
		top: 'center',
		left: 'right',
        color: ['#ff3333', 'orange', 'yellow', 'lime', 'aqua', 'blue'],
        textStyle: {
            color: '#fff'
        }
    },
	*/
    series: [
	        {
	        name: '停车场类型：',
            type: 'scatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(0,304), 100),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'white',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: '#d95850',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '停车场类型：',
            type: 'effectScatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(304,402), 100),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'white',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: '#d95850',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
        {
	        name: '第一类停车场',
            type: 'scatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(0,304), 100),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: '#d95850',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '第一类停车场',
            type: 'effectScatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(304,402), 100),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: '#d95850',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '第二类停车场',
            type: 'scatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(0,304), 90),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: 'orange',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '第二类停车场',
            type: 'effectScatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(304,402), 90),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: 'orange',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
	    {
	        name: '第三类停车场',
            type: 'scatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(0,304), 80),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: '#f2d643',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '第三类停车场',
            type: 'effectScatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(304,402), 80),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: '#f2d643',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '第四类停车场',
            type: 'scatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(0,304), 70),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: '#8dc1a9',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '第四类停车场',
            type: 'effectScatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(304,402), 70),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: '#8dc1a9',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '第五类停车场',
            type: 'scatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(0,304), 60),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: 'aqua',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '第五类停车场',
            type: 'effectScatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(304,402), 60),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: 'aqua',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '第六类停车场',
            type: 'scatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(0,304), 50),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: 'lightskyblue',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        },
		{
	        name: '第六类停车场',
            type: 'effectScatter',
            coordinateSystem: 'bmap',
		    data: convertData(data_parking.slice(304,402), 50),
            symbolSize: function (val) {
                return val[2] / 10;
            },
		    rippleEffect: {
                period: 3,
                brushType: 'stroke',
                scale: 3
            },
            hoverAnimation: true,
            label: {
                normal: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: 'lightskyblue',
                    shadowBlur: 10,
                    shadowColor: '#333'
                }
            },
            zlevel: 1	
		
        }]
    };
	myChart.setOption(option);

/*循环加载停车流图数据*/
var url = ['data/2017年11月1日.json', 'data/2017年11月2日.json', 'data/2017年11月3日.json', 'data/2017年11月4日.json', 'data/2017年11月5日.json', 'data/2017年11月6日.json', 'data/2017年11月7日.json', 'data/2017年11月8日.json', 'data/2017年11月9日.json', 'data/2017年11月10日.json', 'data/2017年11月11日.json', 'data/2017年11月12日.json', 'data/2017年11月13日.json', 'data/2017年11月14日.json', 'data/2017年11月15日.json', 'data/2017年11月16日.json', 'data/2017年11月17日.json', 'data/2017年11月18日.json', 'data/2017年11月19日.json', 'data/2017年11月20日.json', 'data/2017年11月21日.json', 'data/2017年11月22日.json', 'data/2017年11月23日.json', 'data/2017年11月24日.json', 'data/2017年11月25日.json', 'data/2017年11月26日.json', 'data/2017年11月27日.json', 'data/2017年11月28日.json', 'data/2017年11月29日.json', 'data/2017年11月30日.json', 'data/2017年12月1日.json', 'data/2017年12月2日.json', 'data/2017年12月3日.json', 'data/2017年12月4日.json', 'data/2017年12月5日.json', 'data/2017年12月6日.json', 'data/2017年12月7日.json', 'data/2017年12月8日.json', 'data/2017年12月9日.json', 'data/2017年12月10日.json', 'data/2017年12月11日.json', 'data/2017年12月12日.json', 'data/2017年12月13日.json', 'data/2017年12月14日.json', 'data/2017年12月15日.json', 'data/2017年12月16日.json', 'data/2017年12月17日.json', 'data/2017年12月18日.json', 'data/2017年12月19日.json', 'data/2017年12月20日.json', 'data/2017年12月21日.json', 'data/2017年12月22日.json', 'data/2017年12月23日.json', 'data/2017年12月24日.json', 'data/2017年12月25日.json', 'data/2017年12月26日.json', 'data/2017年12月27日.json', 'data/2017年12月28日.json', 'data/2017年12月29日.json', 'data/2017年12月30日.json', 'data/2017年12月31日.json', 'data/2018年1月1日.json', 'data/2018年1月2日.json', 'data/2018年1月3日.json', 'data/2018年1月4日.json', 'data/2018年1月5日.json', 'data/2018年1月6日.json', 'data/2018年1月7日.json', 'data/2018年1月8日.json', 'data/2018年1月9日.json', 'data/2018年1月10日.json', 'data/2018年1月11日.json', 'data/2018年1月12日.json', 'data/2018年1月13日.json', 'data/2018年1月14日.json', 'data/2018年1月15日.json', 'data/2018年1月16日.json', 'data/2018年1月17日.json', 'data/2018年1月18日.json', 'data/2018年1月19日.json', 'data/2018年1月20日.json', 'data/2018年1月21日.json', 'data/2018年1月22日.json', 'data/2018年1月23日.json', 'data/2018年1月24日.json', 'data/2018年1月25日.json', 'data/2018年1月26日.json', 'data/2018年1月27日.json', 'data/2018年1月28日.json', 'data/2018年1月29日.json', 'data/2018年1月30日.json', 'data/2018年1月31日.json', 'data/2018年2月1日.json', 'data/2018年2月2日.json', 'data/2018年2月3日.json', 'data/2018年2月4日.json', 'data/2018年2月5日.json', 'data/2018年2月6日.json', 'data/2018年2月7日.json', 'data/2018年2月8日.json', 'data/2018年2月9日.json'];
var date = ['2017年11月1日', '2017年11月2日', '2017年11月3日', '2017年11月4日', '2017年11月5日', '2017年11月6日', '2017年11月7日', '2017年11月8日', '2017年11月9日', '2017年11月10日', '2017年11月11日', '2017年11月12日', '2017年11月13日', '2017年11月14日', '2017年11月15日', '2017年11月16日', '2017年11月17日', '2017年11月18日', '2017年11月19日', '2017年11月20日', '2017年11月21日', '2017年11月22日', '2017年11月23日', '2017年11月24日', '2017年11月25日', '2017年11月26日', '2017年11月27日', '2017年11月28日', '2017年11月29日', '2017年11月30日', '2017年12月1日', '2017年12月2日', '2017年12月3日', '2017年12月4日', '2017年12月5日', '2017年12月6日', '2017年12月7日', '2017年12月8日', '2017年12月9日', '2017年12月10日', '2017年12月11日', '2017年12月12日', '2017年12月13日', '2017年12月14日', '2017年12月15日', '2017年12月16日', '2017年12月17日', '2017年12月18日', '2017年12月19日', '2017年12月20日', '2017年12月21日', '2017年12月22日', '2017年12月23日', '2017年12月24日', '2017年12月25日', '2017年12月26日', '2017年12月27日', '2017年12月28日', '2017年12月29日', '2017年12月30日', '2017年12月31日', '2018年1月1日', '2018年1月2日', '2018年1月3日', '2018年1月4日', '2018年1月5日', '2018年1月6日', '2018年1月7日', '2018年1月8日', '2018年1月9日', '2018年1月10日', '2018年1月11日', '2018年1月12日', '2018年1月13日', '2018年1月14日', '2018年1月15日', '2018年1月16日', '2018年1月17日', '2018年1月18日', '2018年1月19日', '2018年1月20日', '2018年1月21日', '2018年1月22日', '2018年1月23日', '2018年1月24日', '2018年1月25日', '2018年1月26日', '2018年1月27日', '2018年1月28日', '2018年1月29日', '2018年1月30日', '2018年1月31日', '2018年2月1日', '2018年2月2日', '2018年2月3日', '2018年2月4日', '2018年2月5日', '2018年2月6日', '2018年2月7日', '2018年2月8日', '2018年2月9日'];
void function loop(i){
	if(i<url.length){
		temp = date[i];
        $.ajax({
            url:url[i],
            type:'GET',
            dataType:'json',
            success:function(data) {
	            var SZline = [];
                for(var i=0;i<data.length;i++){
	                SZline.push({
		                coords: data[i],
		                lineStyle: {
                            normal: {
                                //color: echarts.color.modifyHSL('#5A94DF', Math.round(i*0.3))
						        color: 'gold'
                            }
                        }
	                });
                };


    
	option = {
		title: {
	    text: '深圳市停车场信息及停车诱导流图',
		subtext: temp,
		subtextStyle:{
			color:'#fff',
			fontSize:35,
		},
		x: 'left',
		textStyle: {
            color: '#fff',
			fontSize: 35
        }
	},
    series: [      
		{
            type: 'lines',
            coordinateSystem: 'bmap',
            polyline: true,
            data: SZline,
            silent: true,
            lineStyle: {
                normal: {
                    // color: '#c23531',
                    // color: 'rgb(200, 35, 45)',
                    opacity: 0.02,
                    width: 1
                }
            },
            progressiveThreshold: 500,
            progressive: 200
        }, 
		{
            type: 'lines',
            coordinateSystem: 'bmap',
            polyline: true,
            data: SZline,
            lineStyle: {
                normal: {
                    width: 0
                }
            },
            effect: {
                constantSpeed: 20,
                show: true,
                trailLength: 0.1,
                symbolSize: 2
            },
            zlevel: 1
        }]
    };
	myChart.setOption(option);
	console.log(temp);
	console.log(i);
}});
setTimeout(function() {loop(++i);}, 10000);
}else{
	loop(0);
}}(0);;;

if (option && typeof option === "object") {
    myChart.setOption(option, true);
}